[
    {
        "role":"Director, Enterprise Software Delivery",
        "company":"Liberty Mutual Technology Group",
        "summary":"Led in development and oftware delivery and enterprise cloud adoption strategy. Collaborating across IT functions (security, compliance, networking, etc) to expand automation and self-service to reduce time for new applications from weeks to days.",
        "range":"February 2016 - Present"
    },
    {
        "role":"Manager, Enterprise Software Developer",
        "company":"Liberty Mutual Technology Group",
        "summary":"Led team delivering Liberty Mutual's first PaaS, modernizing software delivery. Elimination of legacy hardware and introduction of full configuration-as-code deployments accelerated the adoption of cloud delivery and deployment platforms by 800%.",
        "range":"March 2014 - February 2016"
    },
    {
        "role":"Principal Software Developer",
        "company":"Liberty Mutual Technology Group",
        "summary":"Led strategy for Continuous Integration strategy and testing automation across the company. Worked closely with market representatives, providing education and assisting planning and migrations into the environment. Market decision makers relied significantly on Eddie's recommendations for how they adopt and apply software delivery concepts to their application areas.",
        "range":"February 2013 - March 2014"
    },
    {
        "role":"Senior Software Developer",
        "company":"Liberty Mutual Technology Group",
        "summary":"As team Tech Lead expanded platform offerings and ability to scale while providind Continuous Integration and Continuous Delivery coaching to teams that have a wide range of CI and CD experience.",
        "range":"September 2011 - February 2013"
    },
    {
        "role":"Software Developer",
        "company":"Liberty Mutual Technology Group",
        "summary":"Implmented Liberty's first shared software delivery platform exposing Continuous Integration and automated testing across the company. Particpated in cross-market working groups to create the future vision of Application Lifecycle Management.",
        "range":"March 2010 - September 2011"
    },
    {
        "role":"IT Analyst I and II",
        "company":"Liberty Mutual Technology Group",
        "summary":"Developed various web services across several technical rotations, automating testing and deployment practices to save hundreds of hours of manual effort.",
        "range":"August 2008 - February 2010"
    }
]
