[
    {
        "name":"Organically DevOps: Building Quality and Security into the Software Supply Chain at Liberty Mutual",
        "type":"Talk",
        "date":"November, 2016",
        "summary":"This talk looked at Liberty Mutual’s transformation to Continuous Integration, Continuous Delivery, and DevOps. For a large, heavily regulated industry, this task can not only be daunting, but viewed by many as impossible. Often, organizations try to reduce the friction through micro-fixes, but Eddie’s team asked how to change the culture to reduce the friction and concluded with the following final points:<ul><li>Don’t mandate DevOps. Give employees the chance to master their discipline with examples to set and follow.</li><li>Favor deep end-to-end accomplishments over broad but incremental steps forward. Focus on taking the right teams far before encouraging broad adoption.</li><li>Centralize the platforms and tools that your teams shouldn’t be thinking about. Provide foundational services/commodities and let teams stay on purpose.</li><li>Incorporate contributions from everyone; don’t stifle autonomy. Stay open to new ways of working.</li><li>Challenge security policies, but respect intentions. Find new ways to enforce concerns without abandoning precaution.</li></ul>",
        "link":"http://www.alldaydevops.com/blog/organically-devops-building-quality-and-security-into-the-software-supply-chain-at-liberty-mutual",
        "image":"img/organicdevops.png",
        "tags":["DevOps","Continuous Integration","Continuous Delivery","CI/CD pipelines","agile"]
    },
    {
        "name":"Implementing Access Control Lists in CakePHP",
        "type":"Technical Article",
        "date":"March, 2009",
        "summary":"Demonstrating ability to convey complext technical concepts, this article breaks down the concepts and implementation of ACL for authorization rules in the CakePHP framework. One of the more popular articles on Eddie's now neglected tech blog.",
        "link":"https://blog.edwardawebb.com/web-development/cakephp/started-acl-cakephp",
        "image":"img/cakephp-acls.png",
        "tags":["Technical Writing","PHP","CakePHP"]
    },
    {
        "name":"The 3-legged stool of enterprise cloud adoption",
        "type":"Thought Article",
        "date":"December, 2017",
        "summary":"My team is at the heart of that journey providing the major platforms and tooling that support/enable cloud adoption. But providing tools is never enough, and I’ve been using the analogy of a 3-legged stool to convey this challenge across our company. It’s been a successful model for us, teams using our enterprise pipelines have shifted about 80% of their workloads to one of our strategic cloud targets.",
        "link":"https://medium.com/@edwardawebb/the-3-legged-stool-of-enterprise-cloud-adoption-b16db3fba97d",
        "image":"img/cloudratios.png",
        "tags":["Enterprise Technology","Culture","Cloud","Training"]
    }


]
